#!/bin/bash

#---------------------------------------------------------------------------------------------------------------- TESTING Of THE UUID UTILITY --------------------------------------------------------------------------------------------------------------------------

uuidgen > /dev/null 2&>/dev/null;                                                                                               # Пробуем исполнить exif, подавляя весь вывод
if [ $? -eq 127 ]                                                                                                               # Если код ошибки 127, что значит "Программа не найдена"
        then echo "Can't find uuidgen tool";   									                # Говорим, что программы для анализа exif нету
        exit 1;		                                                                                                        # Завершаем работу скрипта
fi

#---------------------------------------------------------------------------------------------------------------- CREATING OF THE FAKE UUID ----------------------------------------------------------------------------------------------------------------------------

if [ -z "$1" ]															# Если первый агрумент скрипта не определен
	then 
	echo -e "Usage: bootstrap.sh [path to the flash drive root]";									# Говорим, как использовать скрипт
	exit 1;															# Выходим с ошибкой 1
	else
	touch "$1/identity";													
	# Создаем файл identity в корне флешки
	if [ $? == 0 ]														# Если создалось успешно
		then echo -e "Identity file created at $1identity";  								# То говорим, что файл успешно создан
		fakeuuid=`uuidgen`;												# Генерируем набор цифр/букв и запоминаем его в переменной fakeuuid
		echo -e $fakeuuid > $1/identity;										# Пишем набор цифр/букв в identity файл
		echo -e "The fake uuid is generated and written to $1identity";							# Говорим, что набор цифр/букв записан

#---------------------------------------------------------------------------------------------------------------- RESOLVING THE FLASH NAME TO FAKE UUID ----------------------------------------------------------------------------------------------------------------

		echo -e "Give the name of the flash drive $1:";									# Запрашиваем имя для флешки
		read flashname;													# Запоминаем имя
		echo -e "$flashname $fakeuuid" >> .flashdrives;									# Пишем имя и fakeuuid в файл .flashdrives
		echo -e "Written \"$fakeuuid\" to $1identity";									# Говорим, что в файл на флешке записан его fakeuuid
		echo -e "Flashdrives database:"
		echo -e "-------------------------------------";
		cat .flashdrives;												# Для контроля за набором fakeuuid и имен флешок, вывдоим его на консоль
		else "Some problem with file creation at $1identity. Check the write permitions"				# В противном случае, если файл identity не создался, говорим, что есть какая-то проблема с доступом
		exit 1;														# Выходим с ошибкой 1
	fi
fi
